# include "Filter.h"

int IMU_G=0;
int IMU_M=0;

KFP KFP_IMU_G={0.02,0,0,0,0.001,0.543};
KFP KFP_IMU_M={0.02,0,0,0,0.001,0.543};


/*******************************************************************************************************************************
// 函数简介     卡尔曼滤波
// 参数说明     Kalman *kfp 卡尔曼结构体参数
// 输入参数     float input 需要滤波的参数的测量值（即传感器的采集值）
// 返回参数     滤波后的参数（最优值）
// 使用示例
// 备注信息
********************************************************************************************************************************/
float KalmanFilter(KFP *kfp,float input){
     //预测协方差方程：k时刻系统估算协方差 = k-1时刻的系统协方差 + 过程噪声协方差
     kfp->Now_P = kfp->LastP + kfp->Q;
     //卡尔曼增益方程：卡尔曼增益 = k时刻系统估算协方差 / （k时刻系统估算协方差 + 观测噪声协方差）
     kfp->Kg = kfp->Now_P / (kfp->Now_P + kfp->R);
     //更新最优值方程：k时刻状态变量的最优值 = 状态变量的预测值 + 卡尔曼增益 * （测量值 - 状态变量的预测值）
     kfp->out = kfp->out + kfp->Kg * (input -kfp->out);//因为这一次的预测值就是上一次的输出值
     //更新协方差方程: 本次的系统协方差付给 kfp->LastP 威下一次运算准备。
     kfp->LastP = (1-kfp->Kg) * kfp->Now_P;
     return kfp->out;
 }


/*******************************************************************************************************************************
// 函数简介     姿态传感器卡尔曼滤波
// 参数说明
// 输入参数
// 返回参数     滤波后的参数（最优值）
// 使用示例
// 备注信息     放中断
********************************************************************************************************************************/
void IMU_Filter(void){
    IMU_G=KalmanFilter(&KFP_IMU_G,(float)imu963ra_gyro_z);
//    IMU_M=KalmanFilter(&KFP_IMU_M,(float)imu963ra_mag_z);
}
