#include "zf_common_headfile.h"
#include "isr_config.h"
#pragma section all "cpu0_dsram"

//********************************************************宏定义***********************************************************************
#define IPS200_TYPE          (IPS200_TYPE_PARALLEL8)                            // 双排排针 并口两寸屏 这里宏定义填写 IPS200_TYPE_PARALLEL8
soft_iic_info_struct imu660;
//********************************************************宏定义***********************************************************************


//******************************************************** 变量 ***********************************************************************

//******************************************************** 变量 ***********************************************************************


//********************************************************主函数***********************************************************************
int core0_main(void){
    clock_init();                   // 获取时钟频率<务必保留>
    debug_init();                   // 初始化默认调试串口

    Motor_Init();
    gps_init();
    Key_Init();
    soft_iic_init(&imu660,imu660.addr,20, P20_11, P20_14);
    imu660ra_init ();
    ips200_set_dir(IPS200_PORTAIT);
    ips200_set_color(RGB565_WHITE, RGB565_BLACK);
    ips200_init(IPS200_TYPE);

    gyroOffset_init();

    system_delay_ms(750);           //等待所有硬件初始化完毕

    pit_ms_init(CCU61_CH1, 20);      //IMU中断间隔 毫秒
	pit_ms_init(CCU60_CH1, 7);      //电机中断间隔 毫秒

	uart_init(UART_2,115200,UART2_TX_P10_5,UART2_RX_P10_6);

	cpu_wait_event_ready();        // 等待所有核心初始化完毕

	    // VOFA+
	        VOFA* VOFA_pt = vofa_create();       //创建VOFA对象
	        vofa_init(VOFA_pt,                   //初始化当前的vofa对象
	                    vofa_ch_data,ch_sz,
	           custom_buf,custom_sz,
	           cmd_rxbuf,cmd_sz,
	           UART_2,UART_2,UART_2);

	while (TRUE)
//******************************************************** 注意 ***********************************************************************
	    //不要忘记修改舵机PD控制的参数！！！！
	    //不要忘记修改舵机PD控制的参数！！！！
	    //不要忘记修改舵机PD控制的参数！！！！
//******************************************************** 注意 ***********************************************************************
	{

	    if(gps_tau1201_flag){
	        gps_tau1201_flag = 0;
	        gps_data_parse();           // 开始解析数据
	      }

	    Scan_Key();                     // 按键扫描
	    VOFA_Sent();                    // 数据发送
	    UI_Page1();                     // 参数显示
	}
}
//********************************************************主函数***********************************************************************


#pragma section all restore
// **************************** 代码区域 ****************************
